"Common.Cancel" = "Annuler";

"Common.OK" = "OK";

"Common.Info" = "Informations";

"Common.Warning" = "Avertissement";

"Common.Error" = "Erreur";

"Common.Yes" = "Oui";

"Common.No" = "Non";

"Common.Settings" = "Options";

"Common.Logout" = "Déconnexion";

/* MARK: - Endpoint */
"Endpoint.Training" = "https://ubilabstest.sapsailing.com";

/* MARK: - RegattaCheckInController */
"RegattaCheckInController.WelcomeAlert.Title" = "Bonjour %@,";

"RegattaCheckInController.WelcomeAlert.Message" = "Vous êtes en train de vous connecter en tant que '%@'.";

"RegattaCheckInController.WelcomeAlert.CancelAction.Title" = "Ce n'est pas moi !";

/* MARK: - GPSFixController */
"GPSFixController.Mode" = "Mode";

"GPSFixController.Mode.Error" = "Erreur API";

"GPSFixController.Mode.BatterySaving" = "Mode d'économie d'énergie";

"GPSFixController.Mode.None" = "-";

"GPSFixController.Mode.Online" = "En ligne";

"GPSFixController.Mode.Offline" = "Hors ligne";

/* MARK: - LocationManager */
"LocationManager.LocationServicesDeniedError" = "Le GPS est désactivé pour cette application, mais le suivi requiert les données de positions GPS. Souhaitez-vous activer le GPS dans vos options de localisation ?";

"LocationManager.LocationServicesDisabledError" = "Le GPS est désactivé, mais le suivi requiert les données de positions GPS. Souhaitez-vous activer le GPS dans vos options de localisation ?";

"LocationManager.Status" = "Statut";

"LocationManager.Status.Tracking" = "Suivi";

"LocationManager.Status.NotTracking" = "Aucun signal GPS !";

/* MARK: - CheckInDataCollectorError */
"CheckInDataCollectorError.CheckInDataIsIncomplete" = "Aucun ID de marque ou de concurrent trouvé dans le code QR.";

/* MARK: - CheckInRequestManagerError */
"CheckInRequestManagerError.CommunicationFailed" = "Impossible de terminer l'opération sur le serveur. Veuillez réessayer.";

"CheckInRequestManagerError.GetBoatFailed" = "Impossible d'accéder au bateau";

"CheckInRequestManagerError.GetCompetitorFailed" = "Impossible d'accéder au concurrent";

"CheckInRequestManagerError.GetEventFailed" = "Impossible d'accéder à la manifestation";

"CheckInRequestManagerError.GetLeaderboardFailed" = "Impossible d'accéder au palmarès";

"CheckInRequestManagerError.GetMarkFailed" = "Impossible d'accéder à la marque";

"CheckInRequestManagerError.GetTeamFailed" = "Impossible d'accéder à l'équipe";

"CheckInRequestManagerError.PostCheckInFailed" = "Échec de la connexion";

"CheckInRequestManagerError.PostCheckOutFailed" = "Échec de la déconnexion";

"CheckInRequestManagerError.PostGPSFixFailed" = "Impossible d'envoyer les positions GPS";

"CheckInRequestManagerError.PostTeamImageFailed" = "Impossible de charger la photo de l'équipe";

"CheckInRequestManagerError.TeamImageURLIsInvalid" = "L'URL de la photo de l'équipe n'est pas valide.";

/* MARK: - StartView */
"StartView.RegattaButton.Title" = "Régates";

"StartView.TrainingButton.Title" = "Entraînement individuel";

/* MARK: - AboutView */
"AboutView.Title" = "À propos de cette application";

"AboutView.PartnershipTextView.Text" = "L'application SAP Sail InSight exploite les technologies de la téléphonie mobile pour que vous puissiez suivre en direct les bateaux de course. Ainsi, les amis et les supporteurs peuvent suivre les courses à l'aide de palmarès et de la visualisation 2D, qu'ils soient sur le lieu de la compétition ou qu'ils regardent la course en ligne. Après les courses, les navigateurs peuvent les revoir pour évaluer leur performance et optimiser de futures stratégies. Tout est disponible à l'adresse : https://www.sapsailing.com\n\nSAP apporte son soutien à US Sailing grâce à l'implémentation de toute une série de solutions technologiques innovantes. La mise à disposition d'analyses permet aux équipes et aux navigateurs d'améliorer leurs performances. Des applications au service d'un déroulement plus souple des manifestations de voile sont disponibles.\n\nEn tant qu'organisme national responsable des manifestations de voile, US Sailing assure son rôle de leadership pour garantir l'intégrité de la discipline et son développement, notamment par les programmes de formation des officiels de course et des formateurs, ainsi que par l'administration et la supervision des compétitions de voile dans tout le pays.";

"AboutView.TermsButton.Title" = "Contrat de licence utilisateur final";

"AboutView.VersionTitleLabel.Text" = "Version";

/* MARK: - CourseView */
"CourseView.TitleLabel.Text" = "Route fond";

/* MARK: - RegattaCheckInListView */
"RegattaCheckInListView.Title" = "Régates";

"RegattaCheckInListView.HeaderTitleLabel.Text" = "Vos régates :";

"RegattaCheckInListView.FooterTextView.Text" = "Pour en savoir plus, visitez\nhttps://sapsailing.com";

"RegattaCheckInListView.InfoCodeLabel.Text" = "Vous trouverez le code QR sur votre confirmation de participation.";

"RegattaCheckInListView.TermsAlert.Title" = "Contrat de licence utilisateur final";

"RegattaCheckInListView.TermsAlert.Message" = "En utilisant cette application, vous confirmez avoir accepté les termes du contrat de licence utilisateur final de SAP SE. Veuillez prendre connaissance du contrat de licence utilisateur final ici.";

"RegattaCheckInListView.TermsAlert.ShowTermsAction.Title" = "Contrat de licence utilisateur final";

"RegattaCheckInListView.TermsAlert.AcceptTermsAction.Title" = "Confirmer";

"RegattaCheckInListView.NoCameraAlert.Message" = "Le dispositif n'a pas d'appareil photo.";

"RegattaCheckInListView.NoCodeAlert.Title" = "Aucun code QR ?";

"RegattaCheckInListView.NoCodeAlert.Message" = "Veuillez contacter la direction de la course si vous n'avez pas reçu de code QR.";

/* MARK: - TrainingCheckInListView */
"TrainingCheckInListView.Title" = "Entraînements";

"TrainingCheckInListView.HeaderTitleLabel.Text" = "Vos entraînements :";

"TrainingCheckInListView.FooterTextView.Text" = "Afin de pouvoir gérer vos sessions d'entraînement, veuillez créer au moins un entraînement à l'aide du bouton + (Ajouter).";

/* MARK: - TrainingView */
"TrainingView.LeaderboardButton.Title" = "Analyser";

"TrainingView.OptionSheet.CheckOutAction.Title" = "Effacer l'entraînement";

"TrainingView.FinishButton.Title" = "Terminer";

"TrainingView.ReactivateAlert.Title" = "Réactiver l'entraînement";

"TrainingView.ReactivateAlert.Message" = "Cette session d'entraînement est terminée. Voulez-vous réellement continuer et réactiver cette session d'entraînement ?";

"TrainingView.ReactivatedAlert.Title" = "La session d'entraînement est désormais active.";

"TrainingView.FinishAlert.Title" = "Terminer l'entraînement";

"TrainingView.FinishAlert.Message" = "Voulez-vous terminer cette session d'entraînement ?";

"TrainingView.FinishedAlert.Title" = "La session d'entraînement a été correctement terminée.";

"TrainingView.CheckOutAlert.Message" = "Voulez-vous VRAIMENT effacer cette session d'entraînement de votre appareil ?";

/* MARK: - CreateTrainingView */
"CreateTrainingView.Title" = "Créer un entraînement";

"CreateTrainingView.BoatClassNameLabel.Text" = "Catégorie de bateau";

"CreateTrainingView.CreateTrainingButton.Title" = "Créer un entraînement";

/* MARK: - LeaderboardView */
"LeaderboardView.Title" = "Palmarès";

/* MARK: - LicenseView */
"LicenseView.Title" = "Informations sur la licence";

/* MARK: - RegattaView */
"RegattaView.CountdownDaysTitleLabel.Text" = "Jours";

"RegattaView.CountdownHoursTitleLabel.Text" = "Heures";

"RegattaView.CountdownMinutesTitleLabel.Text" = "Minutes";

"RegattaView.StartLabel.Text.BeforeRegattaDidStart" = "Départ de la régate dans :";

"RegattaView.StartLabel.Text.AfterRegattaDidStart" = "La régate est en cours.";

"RegattaView.AnnouncementLabel.Text" = "Veuillez écouter les annonces.";

"RegattaView.EventButton.Title" = "Manifestation";

"RegattaView.StartTrackingButton.Title" = "Lancer le suivi";

"RegattaView.OptionSheet.CheckOutAction.Title" = "Se déconnecter";

"RegattaView.CheckOutAlert.Message" = "Voulez-vous vraiment vous déconnecter ? Vous allez devoir vous reconnecter à l'aide du code QR fourni pour accéder à votre régate.";

/* MARK: - CompetitorView */
"CompetitorView.SelectImageAlert.Title" = "Photo";

"CompetitorView.SelectImageAlert.Message" = "Voulez-vous utiliser une photo existante ou en prendre une nouvelle ?";

"CompetitorView.SelectImageAlert.CameraAction.Title" = "Prendre une photo";

"CompetitorView.SelectImageAlert.PhotoLibraryAction.Title" = "Existante";

"CompetitorView.TeamImageUploadRetryButton.Title" = "Erreur pendant le chargement.\nTouchez pour réessayer.";

"CompetitorView.TeamImageAddButton.Title" = "Ajouter photo de l'équipe";

"CompetitorView.UploadTeamImageFailureAlert.Title" = "Erreur lors du chargement de la photo";

/* MARK: - ScanView */
"ScanView.Title" = "Scanner code QR";

"ScanView.IncorrectCodeAlert.Message" = "Code QR non valide";

/* MARK: - SpeedView */
"SpeedView.TitleLabel.Text" = "Vitesse fond";

/* MARK: - SettingsView */
"SettingsView.Title" = "Options";

"SettingsView.TableView.BatterySavingSection.Title" = "Mode d'économie d'énergie";

"SettingsView.TableView.DeviceSection.Title" = "Informations sur l'appareil";

"SettingsView.TableView.TrainingSection.Title" = "Zone d'entraînement";

"SettingsView.BatterySavingTitleLabel.Text" = "Économiser de l'énergie";

"SettingsView.BatterySavingDescriptionLabel.Text" = "Les mises à jour GPS sont envoyées au serveur toutes les %0.0f secondes.";

"SettingsView.DeviceIdentifierTitleLabel.Text" = "Identificateur d'appareil";

"SettingsView.TrainingServerTitleLabel.Text" = "Point de terminaison du serveur";

/* MARK: - TimerView */
"TimerView.TitleLabel.Text" = "Durée du suivi";

/* MARK: - TrackingView */
"TrackingView.TableView.GPSFixesCell.GPSFixesTitleLabel.Text" = "Positions non envoyées";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyTitleLabel.Text" = "Exactitude du GPS";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyLabel.Text.NoGPS" = "Aucun GPS";

"TrackingView.StopTrackingButton.Title" = "Arrêter le suivi";

"TrackingView.StopTrackingAlert.Title" = "Veuillez confirmer.";

"TrackingView.StopTrackingAlert.Message" = "Voulez-vous vraiment arrêter le suivi ?";

